cf_billing/Catalogs/энргВидыКанальности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргВидыКанальности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Шкалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Шкала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШкалыПоУслугам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Шкала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/энргВидыКанальности/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получить шкалы вида канальности.
//
// Параметры:
//  ВидКанальности	-	СправочникСсылка.энргВидыКанальности.
// 
// Возвращаемое значение:
//  РезультатЗапроса.
//
Функция ПолучитьШкалыВидаКанальности(ВидКанальности) Экспорт 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргВидыКанальности.Ссылка КАК ВидКанальности,
		|	энргВидыКанальностиШкалы.Шкала КАК Шкала
		|ИЗ
		|	Справочник.энргВидыКанальности КАК энргВидыКанальности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыКанальности.Шкалы КАК энргВидыКанальностиШкалы
		|		ПО энргВидыКанальности.Ссылка = энргВидыКанальностиШкалы.Ссылка
		|			И (энргВидыКанальности.Ссылка = &ВидКанальности)
		|			И (энргВидыКанальностиШкалы.Ссылка = &ВидКанальности)
		|			И (НЕ энргВидыКанальности.ПометкаУдаления)";
	
	Запрос.УстановитьПараметр("ВидКанальности", ВидКанальности);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
КонецФункции

#КонецОбласти

#КонецЕсли
